{
    "pages": [
        {
            "page_number": 1,
            "content": "Jessup Cellars Corpus\nJessup Cellars Information\nJessup Cellars has a casual and inviting atmosphere and was the first tasting room opened in Yountville\nin 2003. You have the option of sitting inside our stunning art gallery or you may choose to enjoy the patio\nwith giant umbrellas. We also have space available for private groups and special accommodations and\nsnacks for your children. Our fine art is meticulously curated by our lead artist Jermaine Dante who\nexhibits his colorful creations in large formats in our spacious gallery where you can take in, or take home\nthe inspiring art while imbibing your favorite Jessup wines.\nBOTH SEASONED WINE LOVERS, AND THOSE JUST LEARNING ABOUT WINE, ARE EMBRACED\nAND WELCOMED AT JESSUP CELLARS.\nLocated just a block north from the famed The French Laundry in the quaint village of Yountville, our\nwines are available exclusively through our Tasting Room Gallery and website.\nFounded by Dan and Becky Blue, Roy and Cheri Eisiminger, Vance and Jana Thompson, Jim and Kelly\nMazzo, Kerry and Cindi Solomon, and Eric and Marleen Donnenfeld, their mission is to create and share\nlife-enriching experiences for their members and guests, while also giving back to the community through\nthe support of the arts.\nTHE ART OF HOSPITALITY\nGuests at Jessup Cellars may choose to taste at its wine bar or relax with sit-down, hosted tastings in the\nwinery’s spacious gallery among curated art, which features rotating installations by celebrated regional\nand national artists.The winery also specializes in hosting interactive experiences with a focus on the arts.\nHighlights include its Art House Sessions summer music series and Art House Short Film Series.\nAll of the above, along with exclusive access to limited release wines and member-only events, makes\nJessup Cellars wine club membership one of the best experiences in wine – both in the Napa Valley, and\nwhen guests travel home to share great wine and food with friends and family. For the owners and staff,\nit’s all about creating a community to share their love of wine, the arts, and everything that makes the\nNapa Valley so special.\nCURRENT GALLERY FEATURE\nJERMAINE DANTÉ\nMeet our new resident artist at the Jessup Gallery, Jermaine Danté. As a resident of Napa Valley,\nJermaine’s artwork is characterized by its bold strokes and evocative imagery, serving as a perfect\nembodiment of the symbiotic relationship between art and wine. A certified sommelier, Jermaine captures\nthe essence of Wine Country in many of his pieces, infusing them with his unique perspective and artistic\nflair. Come by to see his art on display this summer and enjoy a glass of wine as you stroll through the\ngallery.\nJessup Cellars and Tasting Gallery is located at 6740 Washington St. at the North end of Yountville\nacross from RH Yountville and North Block Restaurant. We are open from 10AM to 5:30PM 7 days a\nweek and can be reached at 707.944.5620 for reservations and information. Jessup Cellars can be found\nat https://jessupcellars.com/ where you may find directions, purchase wine or make reservations for\ntastings at our Yountville tasting room. Yountville, California is located 9 miles north of Napa and 9 miles\nsouth of St. Helena in the center of the Napa Valley. You can reach Yountville by car from anywhere in the\nNorthern California Bay Area in about an hour, while travelers from the Sacramento region will take about\n1.5 hours. The area is served by multiple airports including SFO, Oakland, Sacramento and Santa Rosa.\nJessup Cellars welcomes your well-behaved dogs inside or outside and we have gluten free dog treats\navailable as well as water dishes. Jessup Cellars wines are carefully crafted with the help of our\nrenowned consulting winemaker Rob Lloyd who famously crafted Chardonnay for Rombauer, La Crema\nand Cakebread. Not only has Rob created one of the best Chardonnays in the Napa Valley with our 2022\n"
        },
        {
            "page_number": 2,
            "content": "vintage, but has also helped curate 'The Art of the Blend' with our stellar red wines.\nJessup Cellars Team\nVOTED MOST FRIENDLY & KNOWLEDGEABLE STAFF 4 YEARS IN A ROW!\nOver the past several years, Jessup Cellars has won numerous awards including CellarPass’ ‘Friendliest\n& Most Knowledgeable Staff’ three years in a row, Napa Valley Life magazine’s ‘Best Wine Club’ and,\nrecently, Yountville’s ‘Business of the Year’.\nhttps://jessupcellars.com/reviews/\nRob Lloyd Consulting Winemaker\nBIOGRAPHY\nHometown: All of California\nFavorite Jessup Wine Pairing: Carneros Chardonnay with freshly caught Mahi-Mahi\nAbout: Rob’s foray into wine started directly after graduating college when he came to Napa to work in a\ntasting room for the summer – before getting a ‘real job’. He became fascinated with wine and the science\nof winemaking and began to learn everything he could about the process.\nWhile interviewing for that “real job”, the interviewer asked him what he had been doing with his time\nsince graduation. After speaking passionately and at length about wine, the interviewer said, “You seem\nto love that so much. Why do you want this job?” Rob realized he didn't want it, actually. He thanked the\nman, and thus began a career in the wine industry.\nRob has since earned his MS in Viticulture & Enology from the University of California Davis and worked\nfor many prestigious wineries including Cakebread, Stag’s Leap Wine Cellars, and La Crema. Rob began\ncrafting Jessup Cellars in the 2009 season and took the position of Director of Winemaking at Jessup\nCellars in 2010. He now heads up our winemaking for the Good Life Wine Collective, which also includes\nHandwritten Wines\nBernardo Munoz Winemaker\nBIOGRAPHY\nHometown: Campeche, Mex\nFavorite Jessup Wine Pairing: 2010 Manny’s Blend with Mongolian Pork Chops from Mustards Grill –\nrichness paired with richness\nAbout: Bernardo began his career in the vineyards, learning the intricacies of grape growing and how to\nadjust to the whims of Mother Nature. He then moved into the cellars at Jessup Cellars, bringing us his\ncomplete grape to bottle knowledge to the team. He has a keen understanding of what it takes to make a\ngreat bottle.\nWhite Wine\nOur leading white wine is our Napa Valley Chardonnay from the Los Carneros region. The Truchard\nVineyard is perfectly located in the hills above Highway 12 with the San Francisco Bay influences creating\na cooler growing climate where the grapes ripen slowly and perfectly on the vine. The perfect weather\ncombines with an ideal terroir to create the foundation for a well-balanced Chardonnay aged for 10\nmonths in 40% new American Oak barrels. We also offer an annual harvest of Sauvignon Blanc which is\nsourced from North Coast vines outside of the Napa Valley. The tropical nature of our 2023 Sauvignon\nBlanc is decidedly different than the typical Sauvignon Blanc grown in the Valley and elsewhere in the\nWorld. Due to its limited supply this wine sells out quickly each year so be sure to give us a call before\nvisiting our tasting room to check availability.\nThe Jessup Cellars 2022 Chardonnay is a white wine that comes across as very well balanced due to the\naging being done in a combination of 40% new American and 60% neutral American Oak. This brings\nhints of oak to the wine while also offering a slightly creamy mouth feel without being a butter bomb. Our\nNapa Valley Chardonnay is a member favorite while the non-member price of $55 is appreciated by\nenthusiasts of this quality wine crafted by Rob Lloyd. The alcohol content is 14.8% while the PH is 3.4.\n"
        },
        {
            "page_number": 3,
            "content": "Our sold out 2023 100% Sauvignon Blanc vintage is sourced from North Coast vineyards aged in 100%\nstainless steel barrels which is typical for this varietal. The stainless steel seals out the oxygen and seals\nin the flavors of the fruit and is a hearty 15.1% alcohol content with a PH of 3.3. While it's nose and\nflavors hint at tropical delights, we would not consider this wine to be too fruit forward, but rather fruit\nbalanced with hints of pineapple and mango. Our Sauvignon Blanc is the perfect hot tub wine or for those\nwarm summer evenings after a long day in the hot summer Sun. You will feel refreshed after enjoying a\nglass or two of our Sauvignon Blanc, non-member price of $45!\nThe 2023 Sauvignon Blanc pairs wonderfully with a variety of dishes, enhancing the dining experience.\nFor starters, it complements the flavors of Grilled Prawn Cocktail and Ceviche, accentuating the seafood's\ndelicate taste and brightening the citrus elements in the dishes. The wine's fruity and floral notes\nbeautifully complement the freshness of Tacos, making it an ideal match for this flavorful and versatile\nMexican dish. Lastly, the wine's high acidity and fruit-forward character provide a delightful contrast to the\ncreamy sweetness of a Peach & Burrata salad, creating a harmonious and memorable pairing.\nRed Wine\nJessup Cellars offers a number of red wines across a range of varietals, from Pinot Noir and Merlot\nblends from the Truchard Vineyard, to blended Cabernet Sauvignon from both the Napa and Alexander\nValleys, our Mendocino Rougette combining Grenache and Carignan varietals which we refer to as our\n'Summer Red', to the ultimate expression of the 'Art of the Blend\" with our Juel and Table for Four Red\nWines. We also offer 100% Zinfandel from 134 year old vines in the Mendocino region and our own 100%\nPetite Sirah grown in the Wooden Valley in Southeastern Napa County. We also offer some seasonal\nfavorites, led by the popular whimsical Manny's Blend which should be released later in 2024 with a very\nspecial label.\nWhat makes our Pinot Noir unique from typical Pinot is the added element of the Jessup 'Art of the Blend'.\nWhile it is 96.7% Pinot Noir with fruit sourced from our favorite Los Carneros Truchard Vineyard, our\nmaster winemakers blend in a little (3.3%) of our own Petite Sirah from our estate vineyard in the Wooden\nValley area of Southeastern Napa County and age it in 50% new French oak for 10 months The alcohol\ncontent of this vintage is 14.8% with a PH of 3.45.This gives our 2021 Pinot Noir a much bolder color,\nvery different from your typical light and bright Pinot you may be accustomed to. This also adds body to\nthe wine which has become a member favorite at Jessup Cellars, priced at $70 for non-members.\nJessup Cellars 2019 Rougette is the perfect blend of Spanish varietals including 87% Grenache and 13%\nCarignane, both coming from our Mendocino growing region which is particularly suited for what we refer\nto as our 'Summer Red'. This beautiful wine of co-fermented Grenache and Carignan varieties greets you\nwith opulent aromas of sweet strawberry, ripe cranberry jam, red plum, cassis, and nutmeg. We aghe this\nwine by co-fermenting the varietals for 15 months in used (neutral) Chardonnay barrels and delivers a\n14.9% alcohol content with a PH of 3.35. The non-member price is $60. The palate is wonderfully dry and\nlifted with fresh acidity and silky, rich tannins. Flavors of brambly, ripe fruit make this wine exceptionally\npalatable and food-friendly. Enjoy it with duck confit, mushroom risotto or an assortment of softer\ncheeses. Drink now or cellar 2-3 years.\nJessup Cellars has a history of making fine big Zinfandels, but the 2020 Pacini Vineyards 100% Zinfandel\nfrom the Talmage Bench in Mendocino County is decidedly different than your typical Zin, with the grapes\nfor this wine coming from 134 year old \"ancient vines\". Brimming with nuances of ripe cranberry,\npomegranate, cherry cola, white pepper, and vanilla, this wine offers soft tannins with a nice, long finish.\nThis wine is aged in used (neutral) Chardonnay barrels with an alcohol content of 14.9%. The price is $60\nfor non-members Pair with pastas, barbequed meats or just pour yourself a glass and enjoy on its own.\nDrink now after decanting or age for up to 9 years.\nOur 2019 Jessup Cellars Merlot is from the Truchard Vineyard in the Los Carneros region of the Napa\nValley which enjoys the San Francisco Bay influences that also envelope our Chardonnay and Pinot Noir.\n"
        },
        {
            "page_number": 4,
            "content": "The terroir is ideally suited for a full bodied Merlot and like many of our wines, our Merlot is reflective of\nthe 'Art of the Blend' by our winemakers. The 2019 Merlot is 80% Merlot, 16.5% Cabernet Sauvignon\nfrom the Chiles Valley AVA in Northeastern Napa County and a splash of our Petite Sirah (3.5%) from the\nsame location finishes the wine perfectly. Our merlot is aged for 22 months in 40% new American/French\noak with an alcohol content of 15.1% with a PH level of 3.55. This wine drinks well now, however, will\ncontinue to age gracefully for another 5-8 years. We recommend trying this delicious Merlot with roasted\nchicken and vegetables or beef bourguignon. Non-members can pick up our 2019 Napa Valley Merlot for\n$70.\nJessup’s Napa Valley Cabernet Sauvignon is a staple of most Napa Valley winemakers with Jessup\noffering our 2019 Cabernet Sauvignon for 2024. As with most of our red wines, our winemakers exercise\n'The Art of the Blend' by starting with 90% Napa Valley fruit from the Chiles Valley AVA in Northeastern\nNapa County, then blend in 5% Petite Sirah from the same AVA, 3% Merlot from our Truchard Vineyard in\nthe Los Carneros region, then finish it with 2.1% Cabernet Franc, which is the parent grape of both\nCabernet Sauvignon and Merlot, often used in blended wines. Cabernet Franc originated in the Bordeaux\nregion of France and to honor that provenance, we age our 2019 Jessup Cellars Cabernet Sauvignon in\n80% new French oak for 22 months. Alcohol content in this varietal is 14.9% with a PH of 3.65. You can\npurchase our 2019 Cab for $90. The palate of the wine matches the aromatics providing juicy fruit flavors,\nrich tannins and a long finish. This wine drinks well now however will age gracefully for the next 5-8\nyears. Enjoy this Cabernet Sauvignon with a quality cut of beef or any dish that has a nice smoky/fatty/or\ncharred quality.\nJessup Cellars has also created a 2018 Alexander Valley Cabernet Sauvignon with 96.5% Cabernet\ngrapes, finished with 3.5% Napa Valley Petite Sirah fruit. This wine has a very different nose and mouth\nfeel than our 2019 Cabernet, presenting a dry, more tannic finish which still feels young but full bodied as\nit crosses your palate. You could lay this bottle down for another 5-8 years as you wait for it to soften, but\nif you want to drink it now, we encourage you to pair this wine with a nice Filet Mignon or other red meat.\nOur Alexander Valley Cabernet is aged in 80% new French oak with an alcohol content of 14.9% and may\nbe purchased for $90 for non-members.\n2019 GRAZIELLA SANGIOVESE BLEND is sold out\n$95.00\n\"Graziella\" is one of the most unique wines that we produce. This harmonious blend of Sangiovese and\nCabernet Sauvignon is one of our smallest production wines which makes it a very special treat for\nwhoever is able to get their hands on it! Our 2019 \"Graziella\" showcases a perfect balance on the nose\nand palate, expressing aromas and flavors of strawberry, red plum, raspberry, vanilla, and rose petal.\nThe mouthfeel is bright and has just the right amount of acidity which makes this wine a wonderful\ncompliment to a variety of dishes. Pair \"Graziella\" with red sauce dishes like lasagna or spiced meat\ndishes like lamb with rosemary. Drink now or cellar this wine for another 5-8 years to see how beautifully\nit develops.\nWINEMAKER NOTES\nComposition: 75% Sangiovese, 25% Cabernet Sauvignon\nAppellation: Napa Valley\nAging: 15 months in French oak\nAlcohol: 14.9%\nPH: 3.6\nJessup Cellars 2019 Juel Red Wine is one exploration of the ultimate 'Art of the Blend' expression. Juel is\nnamed in homage to the Father of one of our owner families which is of Swiss origin. Our winemakers\nhave built a Jessup favorite with this wine composed of 56% Napa Valley Cabernet Sauvignon and 14%\nCabernet Franc, with Merlot figuring heavily into the blend at 24% from our Truchard Vineyard fruit. The\nwine is finished with 2% each of Petite Sirah, Petite Verdot and Malbec, all from the Napa Valley. Jessup\nCellars' 2019 \"Juel\" Blend is a harmonious composition of varietals, a testament to the artistry of\nwinemaking. This wine is a celebration of balance, with its blend of dark fruit, baking spices, and earthy\n"
        },
        {
            "page_number": 5,
            "content": "elements coming together in perfect unison. Approachable yet age-worthy, \"Juel\" is a sensory journey\nthat invites you to savor the intricacies of each sip. Pour a glass, and let the symphony unfold. The\nnon-member price for Juel is $115. Juel is aged in 70% new French oak for 22 months with 14.9% alcohol\nby volume. The PH is 3.65.\n2019 TABLE FOR FOUR CABERNET BLEND\n$115.00\n\"Table for Four\" is our celebrated and signature Cabernet Sauvignon-based blend and is anxiously\nanticipated by both guests and staff alike each year upon its release. Our 2019 vintage carries on the\ntradition of comprising a wine of distinction and depth, with layers of complexity to titillate any wine\nenthusiast. With notes of ripe black cherry and blackberry on the nose, the luscious fruit is accompanied\nby warm and inviting aromas of baking spice and dark cacao. An intriguing layer of subtle floral and\nherbal undertones enhances the complexity, with violet, anise, and a hint of spearmint adding nuance to\nthis incredible profile. The palate sings with harmony as the fruit and spice components interplay, and\nfine, compact tannins give this wine the structural integrity to age for many years to come. With a lovely\nlingering finish, enjoy this wine now for a vibrant experience on the palate, or cellar it to increase its\nnuance in years to come.\nWINEMAKER NOTES\nComposition: 61.8% Cabernet Sauvignon, 26.5% Cabernet Franc, 4.2% Petite Verdot, 3.5% Petite Sirah,\n2.7% Malbec, 1.1% Merlot\nAppellation: 100% Napa Valley\nAging: 22 months in 70% new french oak\nABV: 14.9%\nPH 3.65\nJessup Cellars has introduced our first estate grown 100% Petite Sirah beginning with the 2021 vintage\nas a standalone wine, while also using it extensively in our 'Art of the Blend' winemaking process going\nforward. Our 2021 Petite Sirah offers a captivating sensory journey with a complex blend of flavors and\naromas. The wine opens with luscious notes of blueberry and tart cherry, creating a vibrant and fruity\nintroduction. Pomegranate adds a touch of brightness, complemented by the subtle sweetness of brown\nsugar and the deep richness of cassis. The influence of bourbon and sour mash emerges, contributing a\nlayer of complexity with hints of oak and a delightful cake batter essence. Notes of plum jam adds a\ncomforting touch of sweetness, while cracked pepper brings a subtle spice that enhances the overall\nprofile.The wine showcases robust yet approachable tannins, providing a structured backbone that\npromises aging potential. Bright acidity adds a refreshing quality, balancing the richness of the fruit and\ncontributing to the wine's overall harmony. The finish is long and satisfying, leaving lingering impressions\nof cedar, licorice, and the delicate essence of raspberry. To say the least, there is a lot going on with this\nsublime wine. This wine is aged for 22 months in a mix of used (neutral) French and American barrels\nand is our \"hottest\" wine with an alcohol content of 15.6% with a PH of 3.65.\nOur estate vineyard in the Wooden Valley of Southeastern Napa County will be the foundation for our\ncontinued growth in the Napa Valley.\nFortified and Port Style Wines\nJessup Cellars makes a few fortified vintages of their Zinfandel Port and offers a 100% Cabernet\nSauvignon dessert wine. Jessup Cellars is currently offering our 2013 100% Zinfandel Port fortified with\nBrandy. Some of the most unique and long-lived wines in the World are Port wines. Paying homage to\ntradition, Jessup Cellars has always been known for making quality small batches of Port style wines from\nZinfandel and Cabernet Sauvignon grapes. The 2013 Zinfandel Port is just another phenomenal addition\nto that family. Boasting bold aromatics of ripe raspberry, leather, and spice on the nose, followed by\nvanilla and red plum that dances on the palate. The finish is strong yet balanced making this a perfect\nmatch for blue cheese, dark chocolate or a Maduro cigar. Drink now or cellar for 7-10 years. This\ndelicious wine has an alcohol content of 19.5%, so a little goes a long way. Pricing is $65 dollars for\nnon-members.\n13th Reflection Tawny dessert wine. Crafted in the traditional Solera method, this rich and lush dessert\n"
        },
        {
            "page_number": 6,
            "content": "wine offers pronounced aromas of stewed cherry, dried fig, chocolate, and baking spice with a kiss of\nsandalwood and cedar. A decadent and juicy palate of mixed berry preserves will make a perfect digestif\nafter a rich meal. Deliciously sweet yet fresh,this wine will pair with desserts like chocolate lava cake or a\ncheese course of ripe, aged, salty cheeses. Enjoy it now or cellar for 10-15 years. The Infinite Reflection\n13th Recursion is 100% Napa Valley Cabernet Sauvignon aged for 12 years in French oak with an\nalcohol content of 19.5%. Non-members may purchase this wine for $85.\nThe Solera method is a traditional aging and blending process commonly used in the production of\nfortified wines, including dessert wines like Sherry and Madeira. Here's how it works:\nTiered Stacking: The process begins with a series of barrels or casks arranged in a tiered system called a\n\"solera stack.\" The bottom row contains the oldest wine, while subsequent rows contain progressively\nyounger wines. Fractional Blending: Each year, a portion of wine is drawn from the bottom row of barrels\nfor bottling. This creates space in those barrels, which are then topped up with wine from the row above.\nThe process continues up the stack, with each barrel being partially emptied and then replenished with\nyounger wine. Aging and Maturity: Because the barrels are only partially emptied each year, a portion of\nthe older wine always remains in the barrels, contributing to the complexity and depth of flavor. Over time,\nthe younger wines gradually blend with and inherit characteristics from the older wines.\nConsistency: The Solera method ensures consistency in the final product, as the blend of wines remains\nrelatively constant over time. Even though some wine is removed for bottling each year, the overall\ncharacter of the solera remains consistent due to the blending of older and younger wines.\nPerpetual Process: The Solera system is designed to be perpetual, with new wine continuously added at\nthe top and matured wine drawn from the bottom for bottling. This allows producers to maintain a\nconsistent product while also ensuring that some of the original wine remains in the solera stack,\nsometimes for many years or even decades. Overall, the Solera method is a meticulous and\ntime-honored process that results in complex, well-balanced dessert wines with layers of flavor and\naroma.\nTasting Experiences\nJessup Cellars offers many experiences for enjoying our wines. You may enjoy wine by the glass or by\nthe bottle, but most popular are our tasting flights. Our Light Flight includes 3 wines, starting with either\nour 2022 Chardonnay and includes two of our most requested red wines. The cost per person is $30, and\neach tasting fee will be waived for each purchase of wine over $50. Walk-ins are welcome anytime for our\nLight Flight experience. Our most popular tasting experience is the Jessup Classic Tasting, which\nincludes a flight of 5 wines perfectly paired with cheeses, accompanied by palate cleansing Marcona\nalmonds and a chocolate surprise. The Classic Tasting is $60 per person, but is waived with a purchase\nof two or more bottles of wine per person.\nWine Tasting In Your Dining Room! Jessup Cellars offers a virtual tasting experience for those who may\nnot be able to travel to the Napa Valley and enjoy our tasting room and gallery. Let’s get together for a\nvirtual wine tasting! One of our fantastic wine educators will guide you through a fun and educational\ntasting experience featuring any number of wines that you would like and customized to you. You are\nwelcome to invite your friends, family, and co-workers to join the fun as well! The more, the merrier. We’ll\nuse Zoom, which allows us to host any group size from the comfort of your own homes. “This is the\nRolls-Royce of virtual tastings” – Chowhound Magazine, May 10, 2020. FUN WINE NIGHT ADD-ON!\nSelect your favorite wines to taste with friends & family and connect virtually for an educational wine\ntasting. Along with the wines selected, we’ll ship tasting menus, pens and a map of Napa Valley for your\ngroup to engage with one of our wine educators. The wine you purchase and virtual tasting fee is your\nonly cost. The virtual tasting fee is reimbursed once one case of wine is purchased and the wines you\ntasted (6 bottles) once a total of three cases are purchased which would make it a complimentary event\nfor you!\n"
        },
        {
            "page_number": 7,
            "content": "If you wish to enjoy a personalized experience in your home or business, our Wine Educator will travel to\nyour home or business or event and host a tasting for your friends & colleagues! And… It's complimentary\nonce everyone purchases 3 to 4 bottles. Navigate to https://jessupcellars.com/in-home-wine-tastings/ to\nlearn more and schedule your private tasting experience with your friends, family or colleagues.\nThroughout the year our passionate educator, Adrienne, travels nationwide crafting exceptional Jessup\nCellars Experiences. Forget about coordinating a whole trip to Napa Valley – our tasting room is now in\nyour dining room. Some examples of our current Wine on Location tasting experiences:\nPETIT TASTING\nA perfect way to elevate a dinner with friends! The Petit Tasting is ideal for intimate groups of up to 12\nguests. Led by one of our wine educators, guests will taste through six wines from our portfolio while\nlearning about Napa Valley and our winery. Six bottles of wine are provided for the tasting, which can be\ncustomized to your preference. Members, there is a minimum purchase and a $700 refundable Booking\nfee. Non-members, there is a refundable $1600 Event fee.\nRAND TASTING\nOur most popular tasting over the years that fits any setting! A versatile experience, the Grand Tasting\ncomes with 12 bottles for the experience. Depending on the style of your event, we can taste 6 or 4\ndifferent wines. Members, there is a minimum purchase and a $350 refundable Booking fee.\nNon-members, there is a refundable $2200 Event fee.\nSOIRÉE TASTING\nIdeal for tastings at country clubs, large groups, or just a big celebration! Allow one of our wine educators\nto help you customize your perfect event. Our portfolio of wine provides multiple options depending on\nfood pairings, occasion, and setting. We will provide 4 to 5 each of four different wines of your selection\nfor the tasting. Members, there is a minimum purchase and a $350 refundable Booking fee.\nNon-members, there is a refundable $2800 Event fee.\nWine Club Memberships\nAt Jessup Cellars our Club Members are family, we hope you’ll join us! Our wine clubs are the perfect\nway to stay connected with Jessup Cellars. With our three wine club options you can choose which best\nfits you so there will always be a bottle of Jessup in your home ready to share! As a member of our wine\nclub you will be the first to know about new releases and will receive invitations to “Members Only” special\nevents. We are happy to provide a 15% discount on all your current release orders. Jessup Cellars offers\n3 different membership options, providing flexible quantities and choices of wines with no member fees:\nOption 1 is 'Tasting Club' membership which delivers 3 bottles of wine curated by our team four times per\nyear which may be shipped to your home or business, or you always have the option to come pick up\nyour wines at our Yountville tasting room. The average cost of each shipment is approximately $200 plus\nshipping which varies by region and shipping method.\nOption 2 is 'My Jessup Cellar 6' membership which delivers 6 bottles twice per year in April and\nSeptember and adds the benefit of choice to the program. You may choose your wines in advance and\ndefine the cost based on your selections. The typical Jessup Cellars 6 cost is about $400 twice per year\nplus shipping which varies by region and shipping method.\nOption 3 is 'My Jessup Cellar 12' which includes 12 bottles of wine twice per year, also in April and\nSeptember with an average cost per shipment of $800,and of course you always have the option to pick\nup your wines if you are in the area. The My Jessup 12 members also receive $20 flat rate shipping\nanywhere in the lower 48 states.\nAll of our wine clubs offer the benefits of not only receiving a 15% discount on ALL wine purchases and\nre-orders, but also free tastings a couple of times per year with up to 4 guests in our Yountville Tasting\nGallery. We also offer a $25 gift card if your guests become members while enjoying a tasting at our\nJessup Cellars Tasting Room & Gallery.\n"
        },
        {
            "page_number": 8,
            "content": "Hotels\nThere are a number of beautiful hotels in Yountville, the home of Jessup Cellars tasting room, the oldest\nin Yountville. Yountville, California, located in Napa Valley, is known for its charming atmosphere,\nworld-class dining, and luxury accommodations. Here are some notable hotels in Yountville:\nBardessono Hotel and Spa: This LEED Platinum-certified hotel offers luxurious suites with modern\namenities, an on-site spa, and a farm-to-table restaurant.\nHotel Yountville: A boutique hotel featuring elegant rooms, lush gardens, a spa, and a renowned\nrestaurant, all within walking distance of downtown Yountville.\nVintage House: A luxury hotel with spacious guest rooms, beautifully landscaped grounds, a pool, and\naccess to the nearby Estate Yountville, which includes additional dining options and amenities.\nNorth Block Hotel: This Mediterranean-inspired hotel offers stylish accommodations, a tranquil courtyard,\na pool, and a popular restaurant serving Italian cuisine and is directly across the street from Jessup\nCellars and offers special deals on wine tasting at Jessup.\nThe Estate Yountville: A sprawling resort that includes several luxury hotels such as Vintage House and\nHotel Villagio, as well as upscale dining options, a spa, and event venues.\nNapa Valley Lodge: The Napa Valley Lodge is a charming boutique hotel located in Yountville, California,\nat the heart of Napa Valley wine country and offers 2 for 1 tastings at Jessup Cellars.\nLocation: Situated on Highway 29, the main thoroughfare through Napa Valley, the Napa Valley Lodge\noffers convenient access to numerous wineries, restaurants, and attractions in Yountville and beyond.\nAccommodations: The lodge features spacious and well-appointed guest rooms and suites, each\ndesigned with comfort and relaxation in mind. Many rooms offer views of the surrounding vineyards or the\nbeautifully landscaped gardens. Amenities: Guests at the Napa Valley Lodge can enjoy a range of\namenities, including a heated outdoor pool and hot tub, a fitness center, and complimentary bicycle\nrentals for exploring the local area. Breakfast: A complimentary breakfast buffet is served daily, featuring\na selection of fresh pastries, fruit, yogurt, cereals, and hot items. Concierge Services: The lodge offers\nconcierge services to help guests plan their stay, including arranging wine tastings, restaurant\nreservations, and transportation. Meeting and Event Space: The Napa Valley Lodge also offers meeting\nand event space for corporate gatherings, weddings, and other special occasions, with indoor and\noutdoor venues available. Overall, the Napa Valley Lodge provides a comfortable and welcoming retreat\nfor visitors to Napa Valley, with its picturesque setting overlooking one of Grgich Hills vineyards.\nThese are just a few of the notable hotels in Yountville, each offering its own unique blend of luxury,\ncomfort, and hospitality amidst the stunning backdrop of Napa Valley wine country.\nRestaurants\nThomas Keller, one of the most celebrated chefs in the world, has several restaurants in Yountville,\nCalifornia. Here are the Thomas Keller restaurants in Yountville:\nThe French Laundry: Arguably Keller's most famous restaurant, The French Laundry is a culinary icon\nknown for its exquisite tasting menus, impeccable service, and award-winning wine list. The restaurant is\nhoused in a historic stone building and offers a refined dining experience.\nBouchon Bistro: Located across the street from The French Laundry, Bouchon Bistro is a casual French\nbrasserie serving classic bistro fare. The menu features dishes like steak frites, roast chicken, and\nseafood, as well as a selection of house-made pastries and desserts.\nBouchon Bakery: Adjacent to Bouchon Bistro, Bouchon Bakery offers a tempting array of artisanal\nbreads, pastries, sandwiches, and desserts, as well as coffee and espresso drinks. The bakery is a\npopular spot for breakfast, lunch, and afternoon snacks.\n"
        },
        {
            "page_number": 9,
            "content": "AdHoc: Ad Hoc is another renowned restaurant in Yountville, California, founded by Thomas Keller.\nUnlike The French Laundry or Bouchon, Ad Hoc offers a more casual dining experience with a focus on\nfamily-style meals and is famous for its fried chicken on Monday evenings which is served as part of the\nfixed-price, family-style dinner menu. However, it's always a good idea to check Ad Hoc's website or call\nahead to confirm the schedule, as restaurant operations and special events may vary.\nRO Restaurant and Lounge: Formerly the Regiis Ova Caviar & Champagne Lounge has reopened as a\nwhole new dining spot in Yountville Alongside chef de cuisine Jeffery Hayashi, keller has created a fresh\nmenu with a focus on Asian-inspired cuisine, as well as wine, cocktails and-yes-a large selection of\nChampagne and sparkling.\nLa Calenda: Also located in Yountville, California, and it's indeed a remarkable addition to the culinary\nscene in Napa Valley. Another Thomas Keller creation, La Calenda is a Mexican restaurant inspired by\nthe rich culinary traditions of Oaxaca, Mexico. It offers a modern take on classic Mexican dishes while\nhonoring authentic flavors and techniques. Whatever you do, try the Mole and the margaritas!\nBistro Jeanty: A beloved French bistro located in Yountville, California, known for its authentic French\ncuisine and charming ambiance. Bistro Jeanty offers a menu inspired by traditional French cooking,\nfeaturing dishes like coq au vin, cassoulet, escargot, steak frites, and more. The cuisine is hearty,\ncomforting, and prepared with meticulous attention to detail. Don't miss the tomato bisque in puff pastry!\nLucy Restaurant & Bar: Lucy offers farm-to-table California cuisine with a focus on fresh, locally sourced\ningredients. The menu features a variety of dishes inspired by the seasons, including salads, seafood,\nmeats, and vegetarian options. You must try their brunch menu on weekends as it is the best breakfast in\nYountville.\nCiccio: Ciccio offers contemporary Italian cuisine with a focus on fresh, seasonal ingredients. The menu\nfeatures a variety of classic Italian dishes, as well as innovative interpretations of Italian favorites. Pasta,\npizza, seafood, and meat dishes are all staples of the menu.\nR&D Kitchen: Experience stunning vineyard views from this airy modern building. Featuring outdoor\nseating with relaxing adirondack chairs clustered around fire pits. R+D Kitchen brings sophisticated and\nfresh cuisine to a smart and convivial crowd. With a strong local following in each neighborhood, R+D is\ninspired by California’s indoor/outdoor culture with spaces that are light filled and intimate in feel. Sit at\nthe outdoor bar and enjoy the perfect Napa Valley weather while sipping on a glass of sauvignon blanc\nand sharing a dip duo with friends. If you are looking for a simple place to have one of the best margaritas\nin town look no further. R+D Kitchen’s menu features fresh season ingredients and a little something for\neveryone from sushi to steak and sandwiches to salads. They also have amazing takout pizza at their\nTo-Go location next door.\nBottega: Bottega offers an unmistakably Italian sense of style in a stunning Napa Valley setting. Dine\noutside on our expansive patio, complete with two stone fireplaces to warm you on the coolest Napa\nnights. Inside, you’ll find a warm, rustic setting adorned with Venetian plaster, Murano glass chandeliers,\nsoft leather chairs, and ample tables — the perfect atmosphere for a meal and an experience to\nremember.\nOttimo: In Italian, Ottimo means optimal, first rate, excellent. Michael Chiarello shares a lifetime of\nlearning in the kitchen, with pizzas, fresh mozzarella, coffee, wine, beer, and handcrafted products.\nCoqueta Napa Valley: Coqueta means “flirt” or “infatuation” in Spanish, and represents Michael Chiarello\nand his team’s exploration and interpretation of Spanish Cuisine, wine and inspired cocktails, while\nhighlighting the bounty of Northern California.\nRH Restaurant at RH Yountville :The RH Restaurant is part of the five-building RH Yountville compound\nlocated in the heart of Napa Valley. An integration of food, wine, art and design, the restaurant features\ntimeless classics for brunch and dinner, as well as a selection of wines from esteemed vintners in the\nUnited States and Europe. RH Yountville also features a wine vault.\nThe Kitchen at Priest Ranch: Eat, Drink, Gather - The Kitchen at Priest Ranch combines the vibrant\nflavors of seasonal American cuisine with the regional influences of the Midwest. At The Kitchen, we\n"
        },
        {
            "page_number": 10,
            "content": "source only the freshest locally grown ingredients to create high-quality, approachable dishes that\nshowcase Napa Valley’s bountiful produce in each bite. We believe that great food should be accessible\nto everyone, so we offer a warm and inviting atmosphere, making The Kitchen the perfect spot for a\ncasual yet elevated experience.\nFortunately there are also a couple of great choices to satisfy your sweet tooth in Yountville.\nKollar Chocolates: Kollar Chocolates is an award-winning artisan chocolate shop in the heart of Yountville\nin the Napa Valley. Kollar Chocolates’ mission is to elevate chocolate into a sensory experience driven by\nnew world flavors, modern artistry, ethically sourced ingredients, and innovation.\nAccolades include... TOP 10 CHOCOLATIERS OF NORTH AMERICA by Dessert Professional Magazine\nFOOD NETWORK’S CHOPPED WINNER 2020 - Episode 1, Season 42, “Sweet and Salty Success”\nFEATURED IN OPRAH’S O MAGAZINE - Easter Favorite Things, 2018\nMadeleine's Macarons: \"Handmade French Macarons from the heart of Napa Valley, breakfast and lunch\ncrepes, the best coffee in town, and house made ice cream with local fresh ingredients!\"\nTHE MODEL BAKERY STORY: For close to 90 years, The Model Bakery has been part of the Napa\nValley culinary scene, providing discerning and hungry residents and valley visitors the best breads,\npastries and coffee house at the original location on Main Street in St. Helena. Karen Mitchell, once a\nsuccessful caterer in the Napa Valley, has been the proprietor of The Model Bakery for nearly 30 years\nand the Model bakery in Yountville is in the Caboose at the Railroad Inn Yountville..\nRanch Market Too: In July 1977 the Housley's opened Ranch Market Too in Yountville, and in April 1996,\ntheir son, Arik Housley graduated from Pepperdine University and returned to the valley to take over the\nfamily businesses. In 2008, the deli business in the Yountville store was sold to become an independent\ndeli which has since become Velo Pizza and Deli with pizza by the slice and great deli sandwiches.\n"
        }
    ]
}